{
    "hacking": [
        {
            "id": 1,
            "name": "The Pentester Blueprint",
            "author": "Philip L. Wylie, Kim Crawley",
            "tagline": "Starting a Career as an Ethical Hacker",
            "url": "https://firebasestorage.googleapis.com/v0/b/online-market-796d7.appspot.com/o/The%20Pentester%20BluePrint%20Your%20Guide%20to%20Being%20a%20Pentester%20by%20Phillip%20L.%20Wylie%2C%20Kim%20Crawley%20(z-lib.org)-compressed.pdf?alt=media&token=9769b5d4-9a56-4b9b-88bd-ad096cf3cb4e",
            "image": "https://images-na.ssl-images-amazon.com/images/I/41ufoXrglbL._SX331_BO1,204,203,200_.jpg",
            "desc": "The Pentester BluePrint: Your Guide to Being a Pentester offers readers a chance to delve deeply into the world of the ethical, or 'white-hat' hacker. Accomplished pentester and author Phillip L. Wylie and cybersecurity researcher Kim Crawley walk you through the basic and advanced topics necessary to understand how to make a career out of finding vulnerabilities in systems, networks, and applications. You'll learn about the role of a penetration tester, what a pentest involves, and the prerequisite knowledge you'll need to start the educational journey of becoming a pentester. Discover how to develop a plan by assessing your current skillset and finding a starting place to begin growing your knowledge and skills. Finally, find out how to become employed as a pentester by using social media, networking strategies, and community involvement."
        },
        {
            "id": 2,
            "name": "Linux Basics for Hackers",
            "author": "Occupytheweb",
            "tagline": "Getting Started with Networking, Scripting, and Security in Kali",
            "url": "https://firebasestorage.googleapis.com/v0/b/book2-aa723.appspot.com/o/Linux%20Basics%20for%20Hackers%20Getting%20Started%20with%20Networking%2C%20Scripting%2C%20and%20Security%20in%20Kali%20by%20OccupyTheWeb%20(z-lib.org)-compressed.pdf?alt=media&token=eb7d18ac-2a69-4571-b8f5-e7733e7f34a4",
            "image": "https://images-na.ssl-images-amazon.com/images/I/81TQ6G34JcL.jpg",
            "desc": "This practical, tutorial-style book uses the Kali Linux distribution to teach Linux basics with a focus on how hackers would use them. Topics include Linux command line basics, filesystems, networking, BASH basics, package management, logging, and the Linux kernel and drivers. If you're getting started along the exciting path of hacking, cybersecurity, and pentesting, Linux Basics for Hackers is an excellent first step. Using Kali Linux, an advanced penetration testing distribution of Linux, you'll learn the basics of using the Linux operating system and acquire the tools and techniques you'll need to take control of a Linux environment."
        },
        {
            "id": 3,
            "name": "The Web Application Hacker's Handbook",
            "author": "Dafydd Stuttard, Marcus Pinto",
            "tagline": "Finding and Exploiting Security Flaws",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/The%20web%20application%20hacker%E2%80%99s%20handbook%20finding%20and%20exploiting%20security%20flaws%20by%20Dafydd%20Stuttard%2C%20Marcus%20Pinto%20(z-lib.org).epub.pdf?alt=media&token=a063a8b0-7018-4121-ab03-493627908fff",
            "image": "https://m.media-amazon.com/images/I/51mzEbU-nBL._SX260_.jpg",
            "desc": "The highly successful security book returns with a new edition, completely updated Web applications are the front door to most organizations, exposing them to attacks that may disclose personal information, execute fraudulent transactions, or compromise ordinary users. This practical book has been completely updated and revised to discuss the latest step-by-step techniques for attacking and defending the range of ever-evolving web applications. You'll explore the various new technologies employed in web applications that have appeared since the first edition and review the new attack techniques that have been developed, particularly in relation to the client side."
        },
        {
            "id": 4,
            "name": "Penetration Testing",
            "author": "Georgia Weidman",
            "tagline": "A Hands-On Introduction to Hacking",
            "url": "https://firebasestorage.googleapis.com/v0/b/flutter-app-2ee6b.appspot.com/o/Penetration%20Testing%20A%20Hands-On%20Introduction%20to%20Hacking%20by%20Georgia%20Weidman%20(z-lib.org)-compressed.pdf?alt=media&token=3d25b73c-2504-4fb0-99ce-c7b106d81fbe",
            "image": "https://images-na.ssl-images-amazon.com/images/I/910SUwUs39L.jpg",
            "desc": "In Penetration Testing, security expert, researcher, and trainer Georgia Weidman introduces you to the core skills and techniques that every pentester needs. Using a virtual machine–based lab that includes Kali Linux and vulnerable operating systems, you’ll run through a series of practical lessons with tools like Wireshark, Nmap, and Burp Suite. As you follow along with the labs and launch attacks, you’ll experience the key stages of an actual assessment—including information gathering, finding exploitable vulnerabilities, gaining access to systems, post exploitation, and more."
        },
        {
            "id": 5,
            "name": "Gray Hat Python",
            "author": "Justin Seitz",
            "tagline": "Python Programming for Hackers and Reverse Engineers",
            "url": "https://firebasestorage.googleapis.com/v0/b/flutter-app-2ee6b.appspot.com/o/Gray%20Hat%20Python%20Python%20Programming%20for%20Hackers%20and%20Reverse%20Engineers%20by%20Justin%20Seitz%20(z-lib.org)-compressed.pdf?alt=media&token=888e2f13-44be-42d5-97ec-06fec70644b5",
            "image": "https://images-na.ssl-images-amazon.com/images/I/51miNZHVYmL._SX376_BO1,204,203,200_.jpg",
            "desc": "Gray Hat Python explains the concepts behind hacking tools and techniques like debuggers, trojans, fuzzers, and emulators. But author Justin Seitz goes beyond theory, showing you how to harness existing Python-based security tools—and how to build your own when the pre-built ones won't cut it."
        },
        {
            "id": 6,
            "name": "The Hacker Playbook 3",
            "author": "Peter Kim",
            "tagline": "Practical Guide To Penetration Testing",
            "url": "https://firebasestorage.googleapis.com/v0/b/flutter-app-2ee6b.appspot.com/o/The%20Hacker%20Playbook%203%20Practical%20Guide%20To%20Penetration%20Testing%20by%20Peter%20Kim%20(z-lib.org).epub-compressed.pdf?alt=media&token=6b0c8a98-919a-4281-a9c1-d7aa82c6dbfd",
            "image": "https://images-eu.ssl-images-amazon.com/images/I/51ub94TBqPL._SX342_SY445_QL70_ML2_.jpg",
            "desc": "The main purpose of this book is to answer questions as to why things are still broken. For instance, with all the different security products, secure code reviews, defense in depth, and penetration testing requirements, how are we still seeing massive security breaches happening to major corporations and governments? The real question we need to ask ourselves is, are all the safeguards we are putting in place working? This is what The Hacker Playbook 3 - Red Team Edition is all about."
        },
        {
            "id": 7,
            "name": "The Code Book",
            "author": "Simon Singh",
            "tagline": "How To Make It, Break It, Hack It, Crack It",
            "url": "https://firebasestorage.googleapis.com/v0/b/flutter-app-2ee6b.appspot.com/o/The%20Code%20Book%20How%20to%20Make%20It%2C%20Break%20It%2C%20Hack%20It%2C%20Crack%20It%20by%20Simon%20Singh%20(z-lib.org)-compressed.pdf?alt=media&token=8282cdf6-716f-4556-a7b9-6b8efa391592",
            "image": "https://images-na.ssl-images-amazon.com/images/I/51Q0KH7E1FL.jpg",
            "desc": "It’s known as the science of secrecy. Cryptography: the encoding and decoding of private information. And it is history’s most fascinating story of intrigue and cunning. From Julius Caesar and his Caesar Cipher to the code used by Mary Queen of Scots and her conspiracy to the use of the Engima machine during the Second World War, Simon Singh follows the evolution of secret writing."
        },
        {
            "id": 8,
            "name": "Hacking",
            "author": "Jeff Simon",
            "tagline": "Hacking Practical Guide for Beginners",
            "url": "https://firebasestorage.googleapis.com/v0/b/flutter-app-2ee6b.appspot.com/o/Hacking%20%20Hacking%20Practical%20Guide%20for%20Beginners%20(Hacking%20With%20Python)%20by%20Jeff%20Simon%20(z-lib.org)-compressed.pdf?alt=media&token=0e8fab81-9954-4e92-9a0f-a75947b435e7",
            "image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1474195716l/32069271._SY475_.jpg",
            "desc": "The first chapter of this book explains the basics of hacking and the different types of hackers. The second chapter has a detailed study plan for budding hackers. That study plan will help you improve your skills in a short period of time. The third chapter will teach you how to write your own codes using the Python programming language. The rest of the book contains detailed instructions on how you can become a skilled hacker and penetration tester."
        },
        {
            "id": 9,
            "name": "Black Hat Python",
            "author": "Justin Seitz",
            "tagline": "Python Programming for Hackers and Pentesters",
            "url": "https://firebasestorage.googleapis.com/v0/b/flutter-app-2ee6b.appspot.com/o/Black%20Hat%20Python%20Python%20Programming%20for%20Hackers%20and%20Pentesters%20by%20Justin%20Seitz%20(z-lib.org)-compressed.pdf?alt=media&token=c44723aa-ee8a-49d0-9314-d7e7b48f630b",
            "image": "https://images-na.ssl-images-amazon.com/images/I/A1+3VAjQftL.jpg",
            "desc": "When it comes to creating powerful and effective hacking tools, Python is the language of choice for most security analysts. But just how does the magic happen? In Black Hat Python, the latest from Justin Seitz (author of the best-selling Gray Hat Python), you'll explore the darker side of Python's capabilities—writing network sniffers, manipulating packets, infecting virtual machines, creating stealthy trojans, and more."
        },
        {
            "id": 10,
            "name": "Computer Hacking for Beginners",
            "author": "Dr. Kevin James",
            "tagline": "Dr. Kevin James",
            "url": "https://firebasestorage.googleapis.com/v0/b/flutter-app-2ee6b.appspot.com/o/Computer%20Hacking%20for%20Beginners%20by%20Kevin%20James%20(z-lib.org).epub-compressed.pdf?alt=media&token=b14014df-0071-4379-8c7e-a71ffd32a91c",
            "image": "https://b6t4d8w4.rocketcdn.me/wp-content/uploads/2020/04/Computer-Hacking-for-Beginners-1st-Edition.jpg",
            "desc": "If you want to learn how to build efficient user interfaces with React, this is your book. Authors Alex Banks and Eve Porcello show you how to create UIs with this small JavaScript library that can deftly display data changes on large-scale, data-driven websites without page reloads. Along the way, you'll learn how to work with functional programming and the latest ECMAScript features. Developed by Facebook, and used by companies including Netflix, Walmart, and The New York Times for large parts of their web interfaces, React is quickly growing in use. By learning how to build React components with this hands-on guide, you'll fully understand how useful React can be in your organization. Learn key functional programming concepts with JavaScript Peek under the hood to understand how React runs in the browser Create application presentation layers by mounting and composing React components Use component trees to manage data and reduce the time you spend debugging applications Explore React's component lifecycle and use it to load data and improve UI performance Use a routing solution for browser history, bookmarks, and other features of single-page applications Learn how to structure React applications with servers in mind."
        },
        {
            "id": 11,
            "name": "Hacking",
            "author": "Jon Erikson",
            "tagline": "The Art Of Exploitation",
            "url": "https://firebasestorage.googleapis.com/v0/b/book7-6cc4d.appspot.com/o/Hacking%20The%20Art%20of%20Exploitation%20by%20Jon%20Erickson%20(z-lib.org)-compressed.pdf?alt=media&token=e104f621-dde4-446e-b3dc-1e3c5cadf563",
            "image": "https://images-na.ssl-images-amazon.com/images/I/91UlU666haL.jpg",
            "desc": "Hacking is the art of creative problem solving, whether that means finding an unconventional solution to a difficult problem or exploiting holes in sloppy programming. Many people call themselves hackers, but few have the strong technical foundation needed to really push the envelope. Rather than merely showing how to run existing exploits, author Jon Erickson explains how arcane hacking techniques actually work. To share the art and science of hacking in a way that is accessible to everyone, Hacking: The Art of Exploitation, 2nd Edition introduces the fundamentals of C programming from a hacker's perspective."
        },
        {
            "id": 12,
            "name": "Cyber Operations",
            "author": "Mike O'Leary",
            "tagline": "Building, Defending, and Attacking Modern Computer Networks",
            "url": "https://firebasestorage.googleapis.com/v0/b/book4-49721.appspot.com/o/Cyber%20Operations_%20Building%2C%20Defending%2C%20and%20Attacking%20Modern%20Computer%20Networks%20(%20PDFDrive%20)-compressed.pdf?alt=media&token=dda3c39c-8abb-4aa1-a44c-7f969653a176",
            "image": "https://media.springernature.com/w306/springer-static/cover-hires/book/978-1-4842-4294-0",
            "desc": "Cyber Operations walks you through all the processes to set up, defend, and attack computer networks. This book focuses on networks and real attacks, offers extensive coverage of offensive and defensive techniques, and is supported by a rich collection of exercises and resources. You'll learn how to configure your network from the ground up, starting by setting up your virtual test environment with basics like DNS and active directory, through common network services, and ending with complex web applications involving web servers and backend databases."
        },
        {
            "id": 13,
            "name": "Cyber Security",
            "author": "Thomas A. Jhonson",
            "tagline": "Protecting Critical Infrastructures from Cyber Attack and Cyber Warfare",
            "url": "https://firebasestorage.googleapis.com/v0/b/book4-49721.appspot.com/o/Cyber-security%20Protecting%20Critical%20Infrastructures%20from%20Cyber%20Attack%20and%20Cyber%20Warfare%20(%20PDFDrive%20)-compressed.pdf?alt=media&token=27b93b37-6fe1-4bb5-b8ca-608263a2e2a4",
            "image": "https://images.tandf.co.uk/common/jackets/agentjpg/978148223/9781482239225.jpg",
            "desc": "The World Economic Forum regards the threat of cyber attack as one of the top five global risks confronting nations of the world today. Cyber attacks are increasingly targeting the core functions of the economies in nations throughout the world. The threat to attack critical infrastructures, disrupt critical services, and induce a wide range of dam."
        }
    ]
}