{
    "linux": [
        {
            "id": 1,
            "name": "Ubuntu Made Easy",
            "author": "Rickford Grant, Phil Bull",
            "tagline": "A Project-Based Introduction to Linux",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/Ubuntu%20Made%20Easy%20A%20Project-Based%20Introduction%20to%20Linux%20by%20Rickford%20Grant%2C%20Phil%20Bull%20(z-lib.org)-compressed.pdf?alt=media&token=a7f59f4d-206e-42d6-9ff2-4f2c3369d49e",
            "image": "https://images-na.ssl-images-amazon.com/images/I/51PgSJ6BT3L.jpg",
            "desc": "Ubuntu brings Linux to the masses, but it can still be intimidating for newbies, neophytes, and geeks-in-training. With Ubuntu Made Easy by your side you'll be ready to face any challenge, and you'll discover just how fun Linux can be. Packed with tips, tricks, and helpful pointers, Ubuntu Made Easy will get you up and running with the world's most popular free operating system. Authors Rickford Grant and Phil Bull walk you through common tasks like installing and playing games, accessing your favorite social networks, troubleshooting hardware and software problems, interacting with your Windows installation, and more.."
        },
        {
            "id": 1,
            "name": "Linux System Programming",
            "author": "Robert Love",
            "tagline": "Talking Directly to the Kernel and C Library",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/Linux%20system%20programming%20talking%20directly%20to%20the%20kernel%20and%20C%20library%20by%20Robert%20Love%20(z-lib.org)-compressed.pdf?alt=media&token=c912a6dc-cb39-4761-8999-c7e4a7f4ce27",
            "image": "https://m.media-amazon.com/images/I/51tB8RZgU6L.jpg",
            "desc": "Write software that draws directly on services offered by the Linux kernel and core system libraries. With this comprehensive book, Linux kernel contributor Robert Love provides you with a tutorial on Linux system programming, a reference manual on Linux system calls, and an insider’s guide to writing smarter, faster code."
        },
        {
            "id": 1,
            "name": "Linux Firewalls",
            "author": "Michael Rash",
            "tagline": "Attack Detetion and Response with IPTABLES, PSAD, and FWSNORT",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/Linux%20Firewalls%20Attack%20Detection%20and%20Response%20with%20iptables%2C%20psad%2C%20and%20fwsnort%20by%20Michael%20Rash%20(z-lib.org)-compressed.pdf?alt=media&token=37dd9d81-6781-431a-8f6a-dc0dd14f8b6a",
            "image": "https://m.media-amazon.com/images/I/519DVcaoL8L.jpg",
            "desc": "System administrators need to stay ahead of new security vulnerabilities that leave their networks exposed every day. A firewall and an intrusion detection systems (IDS) are two important weapons in that fight, enabling you to proactively deny access and monitor network traffic for signs of an attack. Linux Firewalls discusses the technical details of the iptables firewall and the Netfilter framework that are built into the Linux kernel, and it explains how they provide strong filtering, Network Address Translation (NAT), state tracking, and application layer inspection capabilities that rival many commercial tools. You'll learn how to deploy iptables as an IDS with psad and fwsnort and how to build a strong, passive authentication layer around iptables with fwknop."
        },
        {
            "id": 1,
            "name": "The Linux Programming Interface",
            "author": "Michael Kerrisk",
            "tagline": "A Linux and UNIX System Programming Handbook",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/The%20Linux%20programming%20interface%20a%20Linux%20and%20UNIX%20system%20programming%20handbook%20by%20Michael%20Kerrisk%20(z-lib.org).pdf?alt=media&token=de92a892-9bc7-43ae-bdbb-dfd940e4e3dc",
            "image": "https://images-na.ssl-images-amazon.com/images/I/71ANvp6Tk4L.jpg",
            "desc": "The Linux Programming Interface (TLPI) is the definitive guide to the Linux and UNIX programming interface—the interface employed by nearly every application that runs on a Linux or UNIX system. While The Linux Programming Interface covers a wealth of Linux-specific features, including epoll, inotify, and the /proc file system, its emphasis on UNIX standards (POSIX.1-2001/SUSv3 and POSIX.1-2008/SUSv4) makes it equally valuable to programmers working on other UNIX platforms. The Linux Programming Interface is the most comprehensive single-volume work on the Linux and UNIX programming interface, and a book that's destined to become a new classic."
        },
        {
            "id": 1,
            "name": "Linux Command Line and Shell Scripting Bible",
            "author": "Richard Blum, Christine Bresnahan",
            "tagline": "The Comprehensive, Tutorial Resource",
            "url": "https://firebasestorage.googleapis.com/v0/b/flutter-app-2ee6b.appspot.com/o/Linux%20Command%20Line%20and%20Shell%20Scripting%20Bible%20by%20Richard%20Blum%2C%20Christine%20Bresnahan%20(z-lib.org)-compressed.pdf?alt=media&token=90289fd1-8358-4ab2-99ea-fac44baaef05",
            "image": "https://images-na.ssl-images-amazon.com/images/I/81v597C82KL.jpg",
            "desc": "Linux Command Line and Shell Scripting Bible is your essential Linux guide. With detailed instruction and abundant examples, this book teaches you how to bypass the graphical interface and communicate directly with your computer, saving time and expanding capability. This third edition incorporates thirty pages of new functional examples that are fully updated to align with the latest Linux features. Beginning with command line fundamentals, the book moves into shell scripting and shows you the practical application of commands in automating frequently performed functions. This guide includes useful tutorials, and a desk reference value of numerous examples."
        },
        {
            "id": 1,
            "name": "Essential System Administration",
            "author": "Æleen Frisch",
            "tagline": "Tools and Techniques for Linux and Unix Administration",
            "url": "https://firebasestorage.googleapis.com/v0/b/book5-9e9f0.appspot.com/o/Essential%20System%20Administration%20Tools%20and%20Techniques%20for%20Linux%20and%20Unix%20Administration%2C%203rd%20Edition%20by%20%C3%86leen%20Frisch%20(z-lib.org).pdf?alt=media&token=9bf59193-3adb-457a-ba89-6be76f562f69",
            "image": "https://images-eu.ssl-images-amazon.com/images/I/515GfW1AEfL._SX342_SY445_QL70_ML2_.jpg",
            "desc": "Essential System Administration,3rd Edition is the definitive guide for Unix system administration, covering all the fundamental and essential tasks required to run such divergent Unix systems as AIX, FreeBSD, HP-UX, Linux, Solaris, Tru64 and more. Essential System Administration provides a clear, concise, practical guide to the real-world issues that anyone responsible for a Unix system faces daily.The new edition of this indispensable reference has been fully updated for all the latest operating systems. Even more importantly, it has been extensively revised and expanded to consider the current system administrative topics that administrators need most. Essential System Administration,3rd Edition covers: DHCP, USB devices, the latest automation tools, SNMP and network management, LDAP, PAM, and recent security tools and techniques.Essential System Administration is comprehensive."
        },
        {
            "id": 1,
            "name": "How Linux Works",
            "author": "Brian Ward",
            "tagline": "What Every Superuser Should Know",
            "url": "https://firebasestorage.googleapis.com/v0/b/book-bb9de.appspot.com/o/How%20Linux%20Works%20What%20Every%20Superuser%20Should%20Know%20by%20Brian%20Ward%20(z-lib.org)-compressed.pdf?alt=media&token=9f734df4-f544-4c88-8c8e-f8dc4777586b",
            "image": "https://images-na.ssl-images-amazon.com/images/I/51LAvDkpwmL._SX375_BO1,204,203,200_.jpg",
            "desc": "How Linux Works describes the inside of the Linux system for systems administrators, whether they maintain an extensive network in the office or one Linux box at home. Some books try to give you copy-and-paste instructions for how to deal with every single system issue that may arise, but How Linux Works actually shows you how the Linux system functions so that you can come up with your own solutions."
        },
        {
            "id": 2,
            "name": "Linux Basics for Hackers",
            "author": "Occupytheweb",
            "tagline": "Getting Started with Networking, Scripting, and Security in Kali",
            "url": "https://firebasestorage.googleapis.com/v0/b/book2-aa723.appspot.com/o/Linux%20Basics%20for%20Hackers%20Getting%20Started%20with%20Networking%2C%20Scripting%2C%20and%20Security%20in%20Kali%20by%20OccupyTheWeb%20(z-lib.org)-compressed.pdf?alt=media&token=eb7d18ac-2a69-4571-b8f5-e7733e7f34a4",
            "image": "https://images-na.ssl-images-amazon.com/images/I/81TQ6G34JcL.jpg",
            "desc": "This practical, tutorial-style book uses the Kali Linux distribution to teach Linux basics with a focus on how hackers would use them. Topics include Linux command line basics, filesystems, networking, BASH basics, package management, logging, and the Linux kernel and drivers. If you're getting started along the exciting path of hacking, cybersecurity, and pentesting, Linux Basics for Hackers is an excellent first step. Using Kali Linux, an advanced penetration testing distribution of Linux, you'll learn the basics of using the Linux operating system and acquire the tools and techniques you'll need to take control of a Linux environment."
        },
        {
            "id": 3,
            "name": "Linux For Beginners",
            "author": "Adam Vardy",
            "tagline": "The Ultimate Guide To The Linux Operating System & Linux",
            "url": "https://firebasestorage.googleapis.com/v0/b/book3-ba8d8.appspot.com/o/Linux%20For%20Beginners_%20The%20Ultimate%20Guide%20To%20The%20Linux%20Operating%20System%20%26%20Linux%20(%20PDFDrive%20)-compressed.pdf?alt=media&token=d3b4abbc-dfdd-4d66-95ef-f4c4d4449607",
            "image": "https://m.media-amazon.com/images/I/51U0NCOFVrL.jpg",
            "desc": "Linux For Beginners! Updated April 2016 The Ultimate Beginners Crash Course To Learning & Mastering Linux Are You Ready To Learn How To Use, Master & Configure Linux? If So You've Come To The Right Place - Regardless Of How Little Experience You May Have! There's a ton of other technical guides out there that aren't clear and concise, and in my opinion use far too much jargon."
        },
        {
            "id": 4,
            "name": "Operating System Concepts and Basic Linux Command",
            "author": "Shital Vivek Ghate",
            "tagline": "Shital Vivek Ghate",
            "url": "https://firebasestorage.googleapis.com/v0/b/book3-ba8d8.appspot.com/o/Operating%20System%20Concepts%20and%20Basic%20Linux%20Commands%20(%20PDFDrive%20)-compressed.pdf?alt=media&token=7b0c9d63-e2dd-448e-b390-fbc29fdaa2a0",
            "image": "https://images-na.ssl-images-amazon.com/images/I/91EpbXTYh4L.jpg",
            "desc": "This book contains the introductory information about the operating system and the basics of Linux commands for graduation level studies. This book provides the concepts of operating system. It contains the fundamental concepts which are applicable to various operating systems. Unit-I explains what is operating system and how the concepts of operating system has developed, contains resource management, structure of operating system, services provided by operating system, types of operating systemit contains the common features of the operating system."
        },
        {
            "id": 5,
            "name": "Kali Linux Revealed",
            "author": "Raphael Hertzog, Jim O'Gorman, Mati Aharoni",
            "tagline": "Mastering the Penetration Testing Distribution",
            "url": "https://firebasestorage.googleapis.com/v0/b/book4-49721.appspot.com/o/Kali%20Linux%20Revealed%20Mastering%20the%20Penetration%20Testing%20Distribution%20by%20Rapha%C3%ABl%20Hertzog%20Jim%20O%E2%80%99Gorman%20Mati%20Aharoni%20(z-lib.org)-compressed.pdf?alt=media&token=a37007fd-428a-4d6d-9272-e053487e4193",
            "image": "https://images-na.ssl-images-amazon.com/images/I/71WlEeiwLTL.jpg",
            "desc": "Kali Linux has not only become the information security professional's platform of choice, but evolved into an industrial-grade, and world-class operating system distribution--mature, secure, and enterprise-ready. Through the decade-long development process, Muts and his team, along with countless volunteers from the hacker community, have taken on the burden of streamlining and organizing our work environment, freeing us from much of the drudgery. They provided a secure and reliable foundation, allowing us to concentrate on securing our digital world."
        },
        {
            "id": 6,
            "name": "Wicked Cool Shell Scripts",
            "author": "Dave Taylor, Brandon Perry",
            "tagline": "101 Scripts for Linux, OS X, and Unix System",
            "url": "https://firebasestorage.googleapis.com/v0/b/book4-49721.appspot.com/o/Wicked%20Cool%20Shell%20Scripts%20101%20Scripts%20for%20Linux%2C%20OS%20X%2C%20and%20UNIX%20Systems%20by%20Dave%20Taylor%2C%20Brandon%20Perry%20(z-lib.org).pdf?alt=media&token=b8e0792d-4745-4094-8772-bbd815247eac",
            "image": "https://images-na.ssl-images-amazon.com/images/I/91yPEGKwJ1L.jpg",
            "desc": "All computers running Linux, Mac OS X, or Unix-like operating systems have a command line interface that gives users a powerful alternative to managing their computers and learning programming basics. Users can write small programs, or scripts, that run in the command line 'shell' to perform everyday tasks like renaming files or processing text. Like the best-selling first edition, this revision of Wicked Cool Shell Scripts provides the full source code for over 100 short shell scripts that solve common problems, can be used to personalize a user's computing environment, and are just plain entertaining. The tools include an interactive calculator, a stock tracker, a password manager, a weather checker, and a website search engine."
        }
    ]
}