{
    "other": [
        {
            "id": 1,
            "name": "Operating System Concepts",
            "author": "Abraham Silberschatz, Peter Baer Galvin, Greg Gagne",
            "tagline": "Abraham Silberschatz, Peter Baer Galvin, Greg Gagne",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/Operating%20System%20Concepts%20by%20Abraham%20Silberschatz%2C%20Greg%20Gagne%2C%20Peter%20B.%20Galvin%20(z-lib.org)-compressed.pdf?alt=media&token=177c84a2-33c4-4186-a6a4-b13344fe2107",
            "image": "https://m.media-amazon.com/images/I/51tezjsttsL._SX260_.jpg",
            "desc": "The tenth edition of Operating System Concepts has been revised to keep it fresh and up-to-date with contemporary examples of how operating systems function, as well as enhanced interactive elements to improve learning and the student’s experience with the material. It combines instruction on concepts with real-world applications so that students can understand the practical usage of the content. End-of-chapter problems, exercises, review questions, and programming exercises help to further reinforce important concepts. New interactive self-assessment problems are provided throughout the text to help students monitor their level of understanding and progress. A Linux virtual machine (including C and Java source code and development tools) allows students to complete programming exercises that help them engage further with the material."
        },
        {
            "id": 1,
            "name": "Learning SQL",
            "author": "Alan Beaulieu",
            "tagline": "Generate, Manipulate, and Retrieve Data",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/Learning%20SQL%20Generate%2C%20Manipulate%2C%20and%20Retrieve%20Data%20by%20Alan%20Beaulieu%20(z-lib.org).epub-compressed.pdf?alt=media&token=37bdb63e-d73e-4f2c-9438-2dbe6df79dbd",
            "image": "https://m.media-amazon.com/images/I/41A-KL8Y1vL.jpg",
            "desc": "As data floods into your company, you need to put it to work right away—and SQL is the best tool for the job. With the latest edition of this introductory guide, author Alan Beaulieu helps developers get up to speed with SQL fundamentals for writing database applications, performing administrative tasks, and generating reports. You’ll find new chapters on SQL and big data, analytic functions, and working with very large databases."
        },
        {
            "id": 1,
            "name": "Dynamic Programming For Coding Interviews",
            "author": "Meenakshi, Kamal Rawat",
            "tagline": "A Bottom-Up Approach to Problem Solving",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/Dynamic%20Programming%20for%20Coding%20Interviews%20A%20Bottom-Up%20Approach%20to%20Problem%20Solving%20by%20Meenakshi%20%2C%20Kamal%20Rawat%20(z-lib.org)-compressed.pdf?alt=media&token=bbcfb244-3999-42fe-8e51-b266453076aa",
            "image": "https://images-na.ssl-images-amazon.com/images/I/71wPCszEvfL.jpg",
            "desc": "Kamal Rawat is a software developer, trainer, author and an entrepreneur. He has first-hand experience of implementing full life cycle of large scale desktop, Cloud and Mobile applications across various domains and platforms. He had been a technical architect in complex projects like Microsoft OneNote, Adobe Photoshop and Samsung GalaxyConnect. He has also been in the core interview panel of Microsoft, Adobe and many start-ups."
        },
        {
            "id": 1,
            "name": "Think Like A Programmer",
            "author": "V. Anton Spraul",
            "tagline": "An Introduction to Creative Problem Solving",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/Think%20Like%20a%20Programmer%20An%20Introduction%20to%20Creative%20Problem%20Solving%20by%20V.%20Anton%20Spraul%20(z-lib.org)-compressed.pdf?alt=media&token=f106f0f3-a62a-4be1-98bd-636bfdae8322",
            "image": "https://images-na.ssl-images-amazon.com/images/I/81KcsnpAvWL.jpg",
            "desc": "The real challenge of programming isn't learning a language's syntax—it's learning to creatively solve problems so you can build something great. In this one-of-a-kind text, author V. Anton Spraul breaks down the ways that programmers solve problems and teaches you what other introductory books often ignore: how to Think Like a Programmer. Each chapter tackles a single programming concept, like classes, pointers, and recursion, and open-ended exercises throughout challenge you to apply your knowledge."
        },
        {
            "id": 1,
            "name": "Software Engineering at Google",
            "author": "Titus Winters, Tom Manshreck, Hyrum Wright",
            "tagline": "Lessons Learned from Programming Over Time",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/Software%20Engineering%20at%20Google%20by%20Hyrum%20Wright%2C%20Tom%20Manshreck%2C%20Titus%20Winters%20(z-lib.org)-compressed.pdf?alt=media&token=37fb8a44-0f7f-4177-92d3-5a37cd94533f",
            "image": "https://images-na.ssl-images-amazon.com/images/I/41oiI3x67dL._SX379_BO1,204,203,200_.jpg",
            "desc": "Today, software engineers need to know not only how to program effectively but also how to develop proper engineering practices to make their codebase sustainable and healthy. This book emphasizes this difference between programming and software engineering. How can software engineers manage a living codebase that evolves and responds to changing requirements and demands over the length of its life? Based on their experience at Google, software engineers Titus Winters and Hyrum Wright, along with technical writer Tom Manshreck, present a candid and insightful look at how some of the world’s leading practitioners construct and maintain software. This book covers Google’s unique engineering culture, processes, and tools and how these aspects contribute to the effectiveness of an engineering organization. You’ll explore three fundamental principles that software organizations should keep in mind when designing, architecting, writing, and maintaining code: How time affects the sustainability of software and how to make your code resilient over time How scale affects the viability of software practices within an engineering organization What trade-offs a typical engineer needs to make when evaluating design and development decisions."
        },
        {
            "id": 1,
            "name": "Practical SQL",
            "author": "Anthony Debarros",
            "tagline": "A beginner's guide to Storytelling with Data",
            "url": "https://firebasestorage.googleapis.com/v0/b/the-radio-94e73.appspot.com/o/Practical%20SQL%20A%20Beginner%E2%80%99s%20Guide%20to%20Storytelling%20with%20Data%20by%20DeBarros%20Anthony%20(z-lib.org)-compressed.pdf?alt=media&token=189bebb7-d1db-4e8b-bd5f-ca3cfac28874",
            "image": "https://images-na.ssl-images-amazon.com/images/I/9180gXazc8L.jpg",
            "desc": "Practical SQL is an approachable and fast-paced guide to SQL (Structured Query Language), the standard programming language for defining, organizing, and exploring data in relational databases. The book focuses on using SQL to find the story your data tells, with the popular open-source database PostgreSQL and the pgAdmin interface as its primary tools. You’ll first cover the fundamentals of databases and the SQL language, then build skills by analyzing data from the U.S. Census and other federal and state government agencies. With exercises and real-world examples in each chapter, this book will teach even those who have never programmed before all the tools necessary to build powerful databases and access information quickly and efficiently."
        },
        {
            "id": 1,
            "name": "Database System Concepts",
            "author": "Silberschatz, Korth, Sudarshan",
            "tagline": "Silberschatz, Korth, Sudarshan",
            "url": "https://firebasestorage.googleapis.com/v0/b/book5-9e9f0.appspot.com/o/Database%20System%20Concepts%20(%20PDFDrive%20)-compressed.pdf?alt=media&token=31a4c023-a79a-4040-85e5-6c8fac317779",
            "image": "https://images-na.ssl-images-amazon.com/images/I/41+cspJiqCL._SX258_BO1,204,203,200_.jpg",
            "desc": "The book commences with a basic introduction, which discusses fundamental topics like Database Languages, Database Users and Administrators, Database Design, and Data Storage and Querying. Then, the book is segregated into ten section. Relational Databases, System Architecture, Speciality Databases, and Transaction Management are a few. Chapters like Object-Relational Mapping, Relevance Ranking Using Terms, and Distributed Data Storage are discussed in detail. This edition also provides a revised coverage of SQL, with greater attention to variants of SQL in actual systems and SQL features. There is also new material on support vector machines, and validation of classifiers."
        },
        {
            "id": 112,
            "name": "Kubernetes In Action",
            "author": "Marko Luksa",
            "tagline": "Marko Luksa",
            "url": "https://firebasestorage.googleapis.com/v0/b/book9-6aed0.appspot.com/o/Kubernetes%20in%20Action%20by%20Marko%20Luksa%20(z-lib.org)-compressed.pdf?alt=media&token=2026c548-5594-4c0f-ad6d-ed0304027b36",
            "image": "https://images-na.ssl-images-amazon.com/images/I/71W457XxK4L.jpg",
            "desc": "Kubernetes in Action teaches you to use Kubernetes to deploy container-based distributed applications. You'll start with an overview of Docker and Kubernetes before building your first Kubernetes cluster. You'll gradually expand your initial application, adding features and deepening your knowledge of Kubernetes architecture and operation. As you navigate this comprehensive guide, you'll explore high-value topics like monitoring, tuning, and scaling.",
            "lang": "English"
        },
        {
            "id": 60,
            "name": "Beginning PHP and MySQL",
            "author": "Frank M. Kromann",
            "tagline": "From Novice to Professional",
            "url": "https://firebasestorage.googleapis.com/v0/b/book5-9e9f0.appspot.com/o/Beginning%20PHP%20and%20MySQL_%20From%20Novice%20to%20Professional%20(%20PDFDrive%20)-compressed.pdf?alt=media&token=3ca09ed9-da15-4e96-bb25-68b5aff1eeb2",
            "image": "https://images.springer.com/sgw/books/medium/9781430260431.jpg",
            "desc": "Written for the budding web developer searching for a powerful, low-cost solution for building flexible, dynamic web sites. Essentially three books in one: provides thorough introductions to the PHP language and the MySQL database, and shows you how these two technologies can be effectively integrated to build powerful websites.",
            "lang": "English"
        },
        {
            "id": 1,
            "name": "Clean Code",
            "author": "Robert C. Martin",
            "tagline": "A Handbook of Agile Software Craftsmanship",
            "url": "https://firebasestorage.googleapis.com/v0/b/book-bb9de.appspot.com/o/Clean%20Code%20-%20A%20Handbook%20of%20Agile%20Software%20Craftsmanship%20by%20Robert%20C.%20Martin%20(z-lib.org)-compressed.pdf?alt=media&token=a99e4489-4877-406e-93cb-32d817596ca1",
            "image": "https://m.media-amazon.com/images/I/41SH-SvWPxL.jpg",
            "desc": "Even bad code can function. But if code isn't clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn't have to be that way."
        },
        {
            "id": 2,
            "name": "Computer Systems",
            "author": "Ata Elahi",
            "tagline": "Digital Design, Fundamentals of Computer Architecture",
            "url": "https://firebasestorage.googleapis.com/v0/b/book-bb9de.appspot.com/o/Computer%20Systems_%20Digital%20Design%2C%20Fundamentals%20of%20Computer%20Architecture%20and%20Assembly%20Language%20(%20PDFDrive%20)-compressed.pdf?alt=media&token=6648c86c-e2fa-4f54-8efb-0f859a6679b8",
            "image": "https://wordery.com/jackets/527d1cf7/computer-systems-ata-elahi-9783319667744.jpg",
            "desc": "This textbook covers digital design, fundamentals of computer architecture, and assembly language. The book starts by introducing basic number systems, character coding, basic knowledge in digital design, and components of a computer. The book goes on to discuss information representation in computing; Boolean algebra and logic gates; sequential logic; input/output; and CPU performance."
        },
        {
            "id": 3,
            "name": "Fundamentals of Software Engineering",
            "author": "Rajib Mall",
            "tagline": "Rajib Mall",
            "url": "https://firebasestorage.googleapis.com/v0/b/book-bb9de.appspot.com/o/Fundamentals%20of%20Software%20Engineering%2C%20Fourth%20Edition%2C%20Rajib%20Mall%20(%20PDFDrive%20)-compressed.pdf?alt=media&token=a5860bac-4d32-4890-bd69-0e59f0193de1",
            "image": "https://images-na.ssl-images-amazon.com/images/I/51x81pPs8gL._SX374_BO1,204,203,200_.jpg",
            "desc": "Now in its fourth edition, this text has been restructured and revised to incorporate the latest advances in the field. It not only incorporates the latest and enhanced software engineering techniques and practices, but also shows how these techniques are applied into the practical software assignments. Chapters now incorporate illustrative examples to add an analytical insight on the subject."
        },
        {
            "id": 4,
            "name": "Clean Architecture",
            "author": "Robert C. Martin",
            "tagline": "A Craftsman's Guide to Software Structures and Design",
            "url": "https://firebasestorage.googleapis.com/v0/b/book4-49721.appspot.com/o/Clean%20Architecture%20A%20Craftsman%E2%80%99s%20Guide%20to%20Software%20Structure%20and%20Design%20by%20Robert%20C.%20Martin%20(z-lib.org)-compressed.pdf?alt=media&token=521b2b22-b217-4d95-8389-c264b9f20f5d",
            "image": "https://images-na.ssl-images-amazon.com/images/I/810b1DUyN-L.jpg",
            "desc": "Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face—the ones that will make or break your projects. Learn what software architects need to achieve—and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services."
        },
        {
            "id": 5,
            "name": "Cracking Coding Interview",
            "author": "Gayle Laakmann Mcdowell",
            "tagline": "189 Programming Questions & Solutions",
            "url": "https://firebasestorage.googleapis.com/v0/b/book6-71fc8.appspot.com/o/Cracking%20the%20Coding%20Interview%20189%20Programming%20Questions%20and%20Solutions%20by%20Gayle%20Laakmann%20McDowell%20(z-lib.org).pdf?alt=media&token=c18febd5-ba7a-47a4-a6ca-ce5bba99bbde",
            "image": "https://images-na.ssl-images-amazon.com/images/I/410hiaPGyCL._SX348_BO1,204,203,200_.jpg",
            "desc": "189 programming interview questions, ranging from the basics to the trickiest algorithm problems. - A walk-through of how to derive each solution, so that you can learn how to get there yourself. - Hints on how to solve each of the 189 questions, just like what you would get in a real interview. - Five proven strategies to tackle algorithm questions, so that you can solve questions you haven't seen. - Extensive coverage of essential topics, such as big O time, data structures, and core algorithms. - A behind the scenes look at how top companies like Google and Facebook hire developers. - Techniques to prepare for and ace the soft side of the interview: behavioral questions. - For interviewers and companies: details on what makes a good interview question and hiring process."
        },
        {
            "id": 6,
            "name": "Code Complete",
            "author": "Steve McConnell",
            "tagline": "A Practical Handbook of Software Construction",
            "url": "https://firebasestorage.googleapis.com/v0/b/book7-6cc4d.appspot.com/o/Code%20Complete%20-%20A%20Practical%20Handbook%20of%20Software%20Construction%20by%20Steve%20McConnell%20(z-lib.org)-compressed.pdf?alt=media&token=9d25a0e5-db8a-4418-a51a-b0f455e4b7fc",
            "image": "https://images-na.ssl-images-amazon.com/images/I/41JOmGowq-L._SX408_BO1,204,203,200_.jpg",
            "desc": "Widely considered one of the best practical guides to programming, Steve McConnell’s original CODE COMPLETE has been helping developers write better software for more than a decade. Now this classic book has been fully updated and revised with leading-edge practices—and hundreds of new code samples—illustrating the art and science of software construction. Capturing the body of knowledge available from research, academia, and everyday commercial practice, McConnell synthesizes the most effective techniques and must-know principles into clear, pragmatic guidance. No matter what your experience level, development environment, or project size, this book will inform and stimulate your thinking—and help you build the highest quality code."
        },
        {
            "id": 8,
            "name": "Refactoring",
            "author": "Martin Fowler",
            "tagline": "Improving The Design of Existing Code",
            "url": "https://firebasestorage.googleapis.com/v0/b/book7-6cc4d.appspot.com/o/Refactoring%20Improving%20the%20Design%20of%20Existing%20Code%20by%20Martin%20Fowler%20(z-lib.org)-compressed.pdf?alt=media&token=c2c3449c-cfed-448d-8b3a-3c400483f0ca",
            "image": "https://m.media-amazon.com/images/I/41odjJlPgHL._SX260_.jpg",
            "desc": "For more than twenty years, experienced programmers worldwide have relied on Martin Fowler’s Refactoring to improve the design of existing code and to enhance software maintainability, as well as to make existing code easier to understand. This eagerly awaited new edition has been fully updated to reflect crucial changes in the programming landscape. Refactoring, Second Edition, features an updated catalog of refactorings and includes JavaScript code examples, as well as new functional examples that demonstrate refactoring without classes.",
            "lang": "English"
        },
        {
            "id": 9,
            "name": "The Pragmatic Programmer",
            "author": "David Thomas, Andrew Hunt",
            "tagline": "Your Journey To Mastery",
            "url": "https://firebasestorage.googleapis.com/v0/b/book7-6cc4d.appspot.com/o/The%20Pragmatic%20Programmer%20Your%20Journey%20to%20Mastery%2C%2020th%20Anniversary%20Edition%20by%20Andrew%20Hunt%20David%20Hurst%20Thomas%20(z-lib.org)-compressed.pdf?alt=media&token=75593a22-1e55-4f9e-abce-c669744a5e89",
            "image": "https://images-na.ssl-images-amazon.com/images/I/51cUVaBWZzL._SX380_BO1,204,203,200_.jpg",
            "desc": "The Pragmatic Programmer is one of those rare tech books you’ll read, re-read, and read again over the years. Whether you’re new to the field or an experienced practitioner, you’ll come away with fresh insights each and every time. Dave Thomas and Andy Hunt wrote the first edition of this influential book in 1999 to help their clients create better software and rediscover the joy of coding. These lessons have helped a generation of programmers examine the very essence of software development, independent of any particular language, framework, or methodology, and the Pragmatic philosophy has spawned hundreds of books, screencasts, and audio books, as well as thousands of careers and success stories."
        },
        {
            "id": 10,
            "name": "The Clean Coder",
            "author": "Robert C. Martin",
            "tagline": "A Code of Conduct for Professional Programmers",
            "url": "https://firebasestorage.googleapis.com/v0/b/book7-6cc4d.appspot.com/o/The%20clean%20coder%20%20a%20code%20of%20conduct%20for%20professional%20programmers%20by%20Martin%2C%20Robert%20C.%20(z-lib.org)-compressed.pdf?alt=media&token=93d40dbf-f1c4-49b9-b1ff-6106bd29cdcc",
            "image": "https://m.media-amazon.com/images/I/51uhS7QO--L.jpg",
            "desc": "In The Clean Coder: A Code of Conduct for Professional Programmers, legendary software expert Robert C. Martin introduces the disciplines, techniques, tools, and practices of true software craftsmanship. This book is packed with practical advice–about everything from estimating and coding to refactoring and testing. It covers much more than technique: It is about attitude. Martin shows how to approach software development with honor, self-respect, and pride; work well and work clean; communicate and estimate faithfully; face difficult decisions with clarity and honesty; and understand that deep knowledge comes with a responsibility to act."
        },
        {
            "id": 11,
            "name": "Computer Architecture",
            "author": "John L. Hennessy, David A. Patterson",
            "tagline": "A Quantitive Approach",
            "url": "https://firebasestorage.googleapis.com/v0/b/book5-9e9f0.appspot.com/o/Computer%20Architecture%2C%20Sixth%20Edition_%20A%20Quantitative%20Approach%20(%20PDFDrive%20)-compressed.pdf?alt=media&token=5b2ceb5c-06bc-4a9e-8c2e-52bee153c170",
            "image": "https://images-na.ssl-images-amazon.com/images/I/51HjJG5krmL.jpg",
            "desc": "Computer Architecture: A Quantitative Approach, Sixth Edition has been considered essential reading by instructors, students and practitioners of computer design for over 20 years. The sixth edition of this classic textbook from Hennessy and Patterson, winners of the 2017 ACM A.M. Turing Award recognizing contributions of lasting and major technical importance to the computing field, is fully revised with the latest developments in processor and system architecture. The text now features examples from the RISC-V (RISC Five) instruction set architecture, a modern RISC instruction set developed and designed to be a free and openly adoptable standard. It also includes a new chapter on domain-specific architectures and an updated chapter on warehouse-scale computing that features the first public information on Google's newest WSC."
        },
        {
            "id": 12,
            "name": "Computer Graphics, C Version",
            "author": "Donald Hearn, M. Pauline Baker",
            "tagline": "Donald Baker, M. Pauline Hearn",
            "url": "https://firebasestorage.googleapis.com/v0/b/book6-71fc8.appspot.com/o/Computer%20Graphics%2C%20C%20Version%20by%20Donald%20Baker%2C%20M.%20Pauline%20Hearn%20(z-lib.org).pdf?alt=media&token=e0deed06-fcfa-4643-8c84-06d86e638306",
            "image": "https://images-na.ssl-images-amazon.com/images/I/51R20C3M3SL.jpg",
            "desc": "Reflecting the rapid expansion of the use of computer graphics and of C as a programming language of choice for implementation, this new version of the best-selling Hearn and Baker text converts all programming code into the C language. Assuming the reader has no prior familiarity with computer graphics, the authors present basic principles for design, use, and understanding of computer graphics systems. The authors are widely considered authorities in computer graphics, and are known for their accessible writing style. A free Open GL supplement is available via the texts Prentice Hall Catalog page."
        }
    ]
}